apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_client.c
#include "app_nus_client.h"
#include "variables.h"
#include "app_error.h"
#include "app_nus_server.h"
#include "ble_db_discovery.h"
#include "ble_nus_c.h"
#include "bsp_btn_ble.h"
#include "nordic_common.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_scan.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#include "fds.h" // Para manejar la memoria flash

#define NUS_SERVICE_UUID_TYPE                                             \
	BLE_UUID_TYPE_VENDOR_BEGIN /**< UUID type for the Nordic UART Service \
	                              (vendor specific). */

#define APP_BLE_CONN_CFG_TAG                                            \
	1 /**< Tag that refers to the BLE stack configuration set with @ref \
	     sd_ble_cfg_set. The default tag is @ref BLE_CONN_CFG_TAG_DEFAULT. */
#define APP_BLE_OBSERVER_PRIO                                            \
	3 /**< BLE observer priority of the application. There is no need to \
	     modify this value. */

BLE_NUS_C_DEF(
    m_ble_nus_c); /**< BLE Nordic UART Service (NUS) client instance. */
BLE_DB_DISCOVERY_DEF(m_db_disc); /**< Database discovery module instance. */
NRF_BLE_GQ_DEF(m_ble_gatt_queue, /**< BLE GATT Queue instance. */
               NRF_SDH_BLE_CENTRAL_LINK_COUNT, NRF_BLE_GQ_QUEUE_SIZE);
NRF_BLE_SCAN_DEF(m_scan); /**< Scanning Module instance. */
static app_nus_client_on_data_received_t m_on_data_received = 0;

// Variable para almacenar la MAC leída desde la memoria flash
static uint8_t mac_address_from_flash[6] = {0};

// Función para leer la MAC desde la memoria flash
static void load_mac_from_flash(void)
{
    fds_record_desc_t record_desc;
    fds_find_token_t ftok = {0};
    fds_flash_record_t flash_record;

    // Busca el registro en la memoria flash
    if (fds_record_find(MAC_FILE_ID, MAC_RECORD_KEY, &record_desc, &ftok) == NRF_SUCCESS)
    {
        if (fds_record_open(&record_desc, &flash_record) == NRF_SUCCESS)
        {
            memcpy(mac_address_from_flash, flash_record.p_data, sizeof(mac_address_from_flash));
            fds_record_close(&record_desc);
            NRF_LOG_INFO("MAC cargada desde memoria flash: %02X:%02X:%02X:%02X:%02X:%02X",
                         mac_address_from_flash[0], mac_address_from_flash[1], mac_address_from_flash[2],
                         mac_address_from_flash[3], mac_address_from_flash[4], mac_address_from_flash[5]);
        }
    }
    else
    {
        NRF_LOG_WARNING("No se encontro una MAC en la memoria flash. Usando valor predeterminado.");
        // Si no se encuentra una MAC, usa una dirección predeterminada
        mac_address_from_flash[0] = 0x63;
        mac_address_from_flash[1] = 0x98;
        mac_address_from_flash[2] = 0x41;
        mac_address_from_flash[3] = 0xD3;
        mac_address_from_flash[4] = 0x03;
        mac_address_from_flash[5] = 0xFB;
    }
}

// Variable global para la dirección del dispositivo objetivo
static ble_gap_addr_t m_target_periph_addr;

// Función para inicializar `m_target_periph_addr` con la MAC leída
static void target_periph_addr_init(void)
{
    // Carga la MAC desde la memoria flash
    load_mac_from_flash();

    // Configura la dirección del dispositivo objetivo
    m_target_periph_addr.addr_type = BLE_GAP_ADDR_TYPE_RANDOM_STATIC;
    memcpy(m_target_periph_addr.addr, mac_address_from_flash, sizeof(mac_address_from_flash));

    NRF_LOG_INFO("Direccion objetivo inicializada: %02X:%02X:%02X:%02X:%02X:%02X",
                 m_target_periph_addr.addr[0], m_target_periph_addr.addr[1], m_target_periph_addr.addr[2],
                 m_target_periph_addr.addr[3], m_target_periph_addr.addr[4], m_target_periph_addr.addr[5]);
}

/**@brief NUS UUID. */
static ble_uuid_t const m_nus_uuid = {.uuid = BLE_UUID_NUS_SERVICE,
                                      .type = NUS_SERVICE_UUID_TYPE};

/**@brief Function for handling the Nordic UART Service Client errors.
 *
 * @param[in]   nrf_error   Error code containing information about what went
 * wrong.
 */
static void nus_error_handler(uint32_t nrf_error)
{
	APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for handling database discovery events.
 *
 * @details This function is a callback function to handle events from the
 * database discovery module. Depending on the UUIDs that are discovered, this
 * function forwards the events to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t* p_evt)
{
	ble_nus_c_on_db_disc_evt(&m_ble_nus_c, p_evt);
}

/** @brief Function for initializing the database discovery module. */
static void db_discovery_init(void)
{
	ble_db_discovery_init_t db_init;

	memset(&db_init, 0, sizeof(ble_db_discovery_init_t));

	db_init.evt_handler = db_disc_handler;
	db_init.p_gatt_queue = &m_ble_gatt_queue;

	ret_code_t err_code = ble_db_discovery_init(&db_init);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function to start scanning. */
static void scan_start(void)
{
	ret_code_t ret;

	ret = nrf_ble_scan_start(&m_scan);
	APP_ERROR_CHECK(ret);

	ret = bsp_indication_set(BSP_INDICATE_SCANNING);
	APP_ERROR_CHECK(ret);
}

/**@brief Function for handling Scanning Module events.
 */
static void scan_evt_handler(scan_evt_t const* p_scan_evt)
{
	ret_code_t err_code;

	switch (p_scan_evt->scan_evt_id)
	{
		case NRF_BLE_SCAN_EVT_CONNECTING_ERROR:
		{
			err_code = p_scan_evt->params.connecting_err.err_code;
			APP_ERROR_CHECK(err_code);
		}
		break;

		case NRF_BLE_SCAN_EVT_CONNECTED:
		{
			ble_gap_evt_connected_t const* p_connected =
			    p_scan_evt->params.connected.p_connected;

			NRF_LOG_RAW_INFO(
			    "\n\nConectado a dispositivo autorizado: "
			    "%02x:%02x:%02x:%02x:%02x:%02x",
			    p_connected->peer_addr.addr[0], p_connected->peer_addr.addr[1],
			    p_connected->peer_addr.addr[2], p_connected->peer_addr.addr[3],
			    p_connected->peer_addr.addr[4], p_connected->peer_addr.addr[5]);
		}
		break;

		case NRF_BLE_SCAN_EVT_SCAN_TIMEOUT:
		{
			NRF_LOG_INFO("Scan timed out.");
			scan_start();
		}
		break;

		case NRF_BLE_SCAN_EVT_FILTER_MATCH:
			break;

		case NRF_BLE_SCAN_EVT_NOT_FOUND:
			break;
	}
}

/**@brief Function for initializing the scanning and setting the filters.
 */
static void scan_init(void)
{
	ret_code_t err_code;
	nrf_ble_scan_init_t init_scan;

	memset(&init_scan, 0, sizeof(init_scan));

	init_scan.connect_if_match = true;
	init_scan.conn_cfg_tag = APP_BLE_CONN_CFG_TAG;

	err_code = nrf_ble_scan_init(&m_scan, &init_scan, scan_evt_handler);
	APP_ERROR_CHECK(err_code);

	err_code = nrf_ble_scan_filter_set(&m_scan, NRF_BLE_SCAN_ADDR_FILTER,
	                                   m_target_periph_addr.addr);
	APP_ERROR_CHECK(err_code);

	err_code =
	    nrf_ble_scan_filters_enable(&m_scan, NRF_BLE_SCAN_ALL_FILTER, false);
	APP_ERROR_CHECK(err_code);
}

/**@brief Callback handling Nordic UART Service (NUS) client events.
 *
 * @details This function is called to notify the application of NUS client
 * events.
 *
 * @param[in]   p_ble_nus_c   NUS client handle. This identifies the NUS client.
 * @param[in]   p_ble_nus_evt Pointer to the NUS client event.
 */

/**@snippet [Handling events from the ble_nus_c module] */
static void ble_nus_c_evt_handler(ble_nus_c_t* p_ble_nus_c,
                                  ble_nus_c_evt_t const* p_ble_nus_evt)
{
	ret_code_t err_code;

	switch (p_ble_nus_evt->evt_type)
	{
		case BLE_NUS_C_EVT_DISCOVERY_COMPLETE:
			// NRF_LOG_INFO("Discovery complete.");
			err_code = ble_nus_c_handles_assign(p_ble_nus_c,
			                                    p_ble_nus_evt->conn_handle,
			                                    &p_ble_nus_evt->handles);
			APP_ERROR_CHECK(err_code);

			err_code = ble_nus_c_tx_notif_enable(p_ble_nus_c);
			APP_ERROR_CHECK(err_code);
			//NRF_LOG_INFO("Emisor conectado mediante BLE NUS");
			break;

		case BLE_NUS_C_EVT_NUS_TX_EVT:
			if (m_on_data_received)
			{
				m_on_data_received(p_ble_nus_evt->p_data,
				                   p_ble_nus_evt->data_len);
			}
			break;

		case BLE_NUS_C_EVT_DISCONNECTED:
			//NRF_LOG_INFO("Emisor desconectado.");
			scan_start();
			break;
	}
}
/**@snippet [Handling events from the ble_nus_c module] */

/**@brief Function for initializing the Nordic UART Service (NUS) client. */
static void nus_c_init(void)
{
	ret_code_t err_code;
	ble_nus_c_init_t init;

	init.evt_handler = ble_nus_c_evt_handler;
	init.error_handler = nus_error_handler;
	init.p_gatt_queue = &m_ble_gatt_queue;

	err_code = ble_nus_c_init(&m_ble_nus_c, &init);
	APP_ERROR_CHECK(err_code);
}

uint32_t app_nus_client_send_data(const uint8_t* data_array, uint16_t length)
{
	return ble_nus_c_string_send(&m_ble_nus_c, (uint8_t*)data_array, length);
}

void app_nus_client_ble_evt_handler(ble_evt_t const* p_ble_evt)
{
	ret_code_t err_code;
	ble_gap_evt_t const* p_gap_evt = &p_ble_evt->evt.gap_evt;
	uint16_t conn_handle = p_ble_evt->evt.gap_evt.conn_handle;

	switch (p_ble_evt->header.evt_id)
	{
		case BLE_GAP_EVT_CONNECTED:
			if (p_gap_evt->params.connected.role == BLE_GAP_ROLE_CENTRAL)
			{
				err_code = ble_nus_c_handles_assign(
				    &m_ble_nus_c, p_ble_evt->evt.gap_evt.conn_handle, NULL);
				APP_ERROR_CHECK(err_code);

				err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
				APP_ERROR_CHECK(err_code);

				// start discovery of services. The NUS Client waits for a
				// discovery result
				err_code = ble_db_discovery_start(
				    &m_db_disc, p_ble_evt->evt.gap_evt.conn_handle);
				APP_ERROR_CHECK(err_code);
			}
			break;
		case BLE_GAP_EVT_DISCONNECTED:
			//NRF_LOG_RAW_INFO("\nBuscando emisor...");
			scan_start();
			break;
	}
}

void app_nus_client_init(app_nus_client_on_data_received_t on_data_received)
{
	m_on_data_received = on_data_received;

	// Inicializa la dirección MAC objetivo
	target_periph_addr_init();

	db_discovery_init();
	nus_c_init();
	scan_init();
	scan_start();
}